In [1]:
import pandas as pd

In [30]:
df1=pd.read_csv("Semana1304.csv")
df1

           IdProducto IdSucursal  Precio
0       0000000001663   00021014   29.90
1       0000000002288   00021032   29.90
2       0000000002288   00021096   39.90
3       0000000205870   00091686  499.99
4       0000000205870   00092248  519.99
...               ...        ...     ...
472161  9569753142128   00002511  139.99
472162  9795403001143   00002511   34.99
472163  9990385651922   00000513  312.50
472164  9990385651939   00000513  312.50
472165  9990385651946   00000513  198.90

[472166 rows x 3 columns]

In [32]:
df1["Semana"]="Semana1304"

In [63]:
# Se realiza una función lambda que quite los "-" al IdProducto ya que dificulta la esteticidad 
# para las posteriores consultas tambien en las bases de datos.
df1['IdProducto']=df1['IdProducto'].apply(lambda x: x.replace('-',''))

In [74]:
# Se le agregan a la columna IdProducto los ceros a la izquierda que faltan para completar los 13 caracteres.
df1["IdProducto"]=df1["IdProducto"].str.zfill(13)

In [34]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 472166 entries, 0 to 472165
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   IdProducto  472166 non-null  object
 1   IdSucursal  472166 non-null  object
 2   Precio      472166 non-null  float64
 3   Semana      472166 non-null  object
dtypes: float64(1), object(3)
memory usage: 14.4+ MB

In [52]:
df2=pd.read_csv("Semana1904.csv")
df2

C:\Users\Usuario\AppData\Local\Temp\ipykernel_3296\823881160.py:1: DtypeWarning: Columns (0) have mixed types. Specify dtype option on import or set low_memory=False.
  df2=pd.read_csv("Semana1904.csv")

           IdProducto  IdSucursal    Precio
0       0000000002288       21184     29.90
1       0000000002288       21206     39.90
2       0000000020587       91430    499.99
3       0000000020587       92107    539.99
4       0000000020587     9035218    539.99
...               ...         ...       ...
937447  9569753142128        2511  13999.00
937448  9795403001143        2511   3499.00
937449  9990385651922         513   3125.00
937450  9990385651939         513   3125.00
937451  9990385651946         513   1989.00

[937452 rows x 3 columns]

In [53]:
df2["Semana"]="Semana1904"

In [66]:
# Se realiza una función lambda que quite los "-" al IdProducto ya que dificulta la esteticidad 
# para las posteriores consultas tambien en las bases de datos.
df2['IdProducto']=df2['IdProducto'].astype(str).apply(lambda x: x.replace('-',''))

In [73]:
# Se le agregan a la columna IdProducto los ceros a la izquierda que faltan para completar los 13 caracteres.
df2["IdProducto"]=df2["IdProducto"].str.zfill(13)

In [55]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 937452 entries, 0 to 937451
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   IdProducto  937452 non-null  object
 1   IdSucursal  937452 non-null  int64
 2   Precio      937452 non-null  float64
 3   Semana      937452 non-null  object
dtypes: float64(1), int64(1), object(2)
memory usage: 28.6+ MB

In [37]:
df3=pd.read_csv("Semana0305.csv")
df3

           IdProducto  IdSucursal  Precio
0       0000000002288       21187   29.90
1       0000000002288       23247   39.90
2       0000000205870       91685  499.99
3       0000000205870        9222  539.99
4       0000000205870        9259  519.99
...               ...         ...     ...
397729  9569753142128        2511  139.99
397730  9795403001143        2511   34.99
397731  9990385651922         515  312.50
397732  9990385651939         515  312.50
397733  9990385651946         515  198.90

[397734 rows x 3 columns]

In [38]:
df3["Semana"]="Semana0305"

In [67]:
# Se realiza una función lambda que quite los "-" al IdProducto ya que dificulta la esteticidad 
# para las posteriores consultas tambien en las bases de datos.
df3['IdProducto']=df3['IdProducto'].apply(lambda x: x.replace('-',''))

In [72]:
# Se le agregan a la columna IdProducto los ceros a la izquierda que faltan para completar los 13 caracteres.
df3["IdProducto"]=df3["IdProducto"].str.zfill(13)

In [40]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397734 entries, 0 to 397733
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   IdProducto  397734 non-null  object
 1   IdSucursal  397734 non-null  int64
 2   Precio      397734 non-null  float64
 3   Semana      397734 non-null  object
dtypes: float64(1), int64(1), object(2)
memory usage: 12.1+ MB

In [41]:
df4=pd.read_csv("Semana1805.csv")
df4

           IdProducto  IdSucursal  Precio
0       0000000002288       21009   29.90
1       0000000002288       21037   32.90
2       0000000002288       21090   36.90
3       0000000002288       23247   39.90
4       0000000205870       91430  499.99
...               ...         ...     ...
415288  9569753142128        2511  149.99
415289  9795403001143        2511   34.99
415290  9990385651922         514  312.50
415291  9990385651939         514  312.50
415292  9990385651946         514  198.90

[415293 rows x 3 columns]

In [42]:
df4["Semana"]="Semana1805"

In [69]:
# Se realiza una función lambda que quite los "-" al IdProducto ya que dificulta la esteticidad 
# para las posteriores consultas tambien en las bases de datos.
df4['IdProducto']=df4['IdProducto'].astype(str).apply(lambda x: x.replace('-',''))

In [71]:
# Se le agregan a la columna IdProducto los ceros a la izquierda que faltan para completar los 13 caracteres.
df4["IdProducto"]=df4["IdProducto"].str.zfill(13)

In [44]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 415293 entries, 0 to 415292
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   IdProducto  415287 non-null  object
 1   IdSucursal  415293 non-null  int64
 2   Precio      415293 non-null  float64
 3   Semana      415293 non-null  object
dtypes: float64(1), int64(1), object(2)
memory usage: 12.7+ MB

In [56]:
PreciosSemana = pd.concat([df1,df2,df3,df4], axis=0, ignore_index=True)
PreciosSemana

            IdProducto IdSucursal  Precio      Semana
0        0000000001663   00021014   29.90  Semana1304
1        0000000002288   00021032   29.90  Semana1304
2        0000000002288   00021096   39.90  Semana1304
3        0000000205870   00091686  499.99  Semana1304
4        0000000205870   00092248  519.99  Semana1304
...                ...        ...     ...         ...
2222640  9569753142128       2511  149.99  Semana1805
2222641  9795403001143       2511   34.99  Semana1805
2222642  9990385651922        514  312.50  Semana1805
2222643  9990385651939        514  312.50  Semana1805
2222644  9990385651946        514  198.90  Semana1805

[2222645 rows x 4 columns]

In [57]:
PreciosSemana.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2222645 entries, 0 to 2222644
Data columns (total 4 columns):
 #   Column      Dtype
---  ------      -----
 0   IdProducto  object
 1   IdSucursal  object
 2   Precio      float64
 3   Semana      object
dtypes: float64(1), object(3)
memory usage: 67.8+ MB

In [58]:
PreciosSemana["Semana"].info(
    
)

<class 'pandas.core.series.Series'>
RangeIndex: 2222645 entries, 0 to 2222644
Series name: Semana
Non-Null Count    Dtype
--------------    -----
2222645 non-null  object
dtypes: object(1)
memory usage: 17.0+ MB

In [78]:
# Se realiza una función lambda que quite los "-" al IdProducto ya que dificulta la esteticidad 
# para las posteriores consultas tambien en las bases de datos.
PreciosSemana['IdProducto']=PreciosSemana['IdProducto'].astype(str).apply(lambda x: x.replace('-',''))

In [79]:
# Se le agregan a la columna IdProducto los ceros a la izquierda que faltan para completar los 13 caracteres.
PreciosSemana["IdProducto"]=PreciosSemana["IdProducto"].str.zfill(13)

In [80]:
PreciosSemana.to_csv("PreciosSemana.csv",index=False)

In [81]:
PreciosSemana.to_csv(r"C:\ProgramData\MySQL\MySQL Server 8.0\Uploads\PreciosSemana.csv",index=False)